/*
function компонента для айтема (лі з текстом + кнопкою)

За натисненням на кнопку лі зникає з екрану

1. Зробити функціональну компоненту.
2. Винести в цю функцінальну компоненту <1i>
3. Переписати логіку відмальування лішки так, що дані тепер будуть спускатись від батька через пропси
4. Зробити колбек в батьківського елемента, який має отримати id на вхід та видалити зі стейта елемент з
5. В компоненті TodoItem зробити виклик колбека і передати йому id (за тиснення на кнопку)



*/

function TodoItem(props) {
  return (
    <li>
      {props.text}
      <button
        onClick={() => {
          props.delCallback();
        }}
      >
        x
      </button>
    </li>
  );
}

export default TodoItem;
