import React from 'react';

class Greeting extends React.Component {
  constructor(props) {
    super(props);

    this.state = {
        // 1. Створити змінну стейту( за аналогією з лампочкою)
    };
  }

// 2. Зробити події кліку на h1 ( за аналогією з лампочкою)

  // тут можуть бути обробники подій
  render() {
// 3ю В заледності від значення стейту, вирахувати що за текст ви показуєте ( за аналогією з лампочкою) 

    return <h1>Hello {this.props.name}</h1>;
    // P.S  Не забудьте підписати обробник подій кліку, розроблений у п.2
  }
}

export default Greeting;

/*
Доробити компоненту таким чином, щоб за натисненням на h1 текст hello змінювався на bye
*/
